#ex_14.for.py 저장
'''
형식) for 출력변수명 in 출력대상자(list,set,tuple,dic):
         수행문장
'''
for i in [1,2,3,4,5]:
    print(i,end=' ')#1 2 3 4 5 
else:
    print('for문 종료')#1 2 3 4 5 for문 종료
#이중 for문 => 구구단 출력->2,3단(표형태로 출력)
for n in [2,3]:#행을 선택
    print('--{}단--'.format(n))
    #열을 선택
    for i in [1,2,3,4,5,6,7,8,9]:#range(1,10):
        print('{0} * {1} = {2}'.format(n,i,n*i))
'''
--2단--
2 * 1 = 2
2 * 2 = 4
2 * 3 = 6
2 * 4 = 8
2 * 5 = 10
2 * 6 = 12
2 * 7 = 14
2 * 8 = 16
2 * 9 = 18
--3단--
3 * 1 = 3
3 * 2 = 6
3 * 3 = 9
3 * 4 = 12
3 * 5 = 15
3 * 6 = 18
3 * 7 = 21
3 * 8 = 24
3 * 9 = 27
'''